<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2017.2 (Released Jan 23, 2017) -->
<HTML>
<HEAD>
<TITLE>try</TITLE>
<META NAME="description" CONTENT="try">
<META NAME="keywords" CONTENT="try">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META NAME="Generator" CONTENT="LaTeX2HTML v2017.2">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="try.css">

</HEAD>

<BODY >

<P>

<H1><A NAME="SECTION00010000000000000000"></A><A NAME="ch:historia"></A><BR>
INTRODUCCI&#211;N HIST&#211;RICA DEL DODECAFONISMO
</H1>
	
<H2><A NAME="SECTION00011000000000000000">
Richard Wagner y la emancipaci&#243;n de la disonancia</A>
</H2>

<P>

<DIV ALIGN="CENTER">
			<DIV ALIGN="CENTER">

</DIV>
			<IMG
  WIDTH="119" HEIGHT="119" ALIGN="BOTTOM" BORDER="0"
 SRC="./Richard_Wagner.jpg"
 ALT="Image Richard_Wagner">
<BR>			Richard Wagner
<BR>(1813-1883)	
		
</DIV>

<P>
El periodo de la historia de la m&#250;sica predominante en el siglo XIX, com&#250;nmente llamado Romanticismo, culmin&#243; con los dramas musicales de Richard Wagner, en los que todos los elementos de la obra estaban detalladamente estudiados por el compositor. A este concepto lo llamaba <SPAN  CLASS="textit">Gesamtkunstwerk</SPAN> (&#171;obra de arte total&#187;<A NAME="tex2html1"
  HREF="#foot99"><SUP><SPAN CLASS="arabic">1</SPAN></SUP></A>), ya que cre&#237;a poseer la responsabilidad de reunir todas las artes en una misma obra. Wagner se aseguraba personalmente de que en sus &#243;peras las artes esc&#233;nicas, musicales, po&#233;ticas y visuales se combinaran entre s&#237; a la perfecci&#243;n.

<P>
La idea del <SPAN  CLASS="textit">Gesamtkunstwerk</SPAN> la desarroll&#243; alrededor de 1850, y la plasm&#243; en su totalidad en su ciclo de cuatro &#243;peras <SPAN  CLASS="textit">Der Ring des Nibelungen</SPAN>, estrenado el 16 de agosto de 1876. Wagner control&#243; y cre&#243; cada aspecto de la tetralog&#237;a, desde la m&#250;sica hasta el libreto, el vestuario y la escenograf&#237;a. Incluso mand&#243; crear su propia sala de conciertos en Bayreuth, el <SPAN  CLASS="textit">Festspielhaus</SPAN>, para que el escenario se adecuara a sus ideas sobre el pensamiento y la cultura musical.

<P>
As&#237;, a ojos de compositores posteriores, Wagner hab&#237;a agotado todas las posibilidades de la m&#250;sica tonal, y quiz&#225;s ya hab&#237;a comenzado el viraje hacia el predominio de la disonancia con su abundante uso del cromatismo, como en el famoso primer acorde del drama musical <SPAN  CLASS="textit">Tristan und Isolde</SPAN> (1865). Consta de las notas Fa, Si, <!-- MATH
 $\mbox{Re\#}$
 -->
<SPAN CLASS="MATH">Re#</SPAN> y <!-- MATH
 $\mbox{Sol\#}$
 -->
<SPAN CLASS="MATH">Sol#</SPAN>, y sus intervalos desde el Fa son una cuarta aumentada, una sexta aumentada y una novena aumentada.

<P>
Siguiendo la concepci&#243;n del progreso como un camino ascendente, el paso siguiente para la composici&#243;n musical deb&#237;a consistir en deshacerse progresivamente de la tonalidad y desarrollar la &#171;emancipaci&#243;n de la disonancia&#187;<A NAME="tex2html2"
  HREF="#foot100"><SUP><SPAN CLASS="arabic">2</SPAN></SUP></A>. As&#237; fue como Arnold Schoenberg ide&#243; sus teor&#237;as del pensamiento musical, y &#233;stas dieron paso a la creaci&#243;n de la atonalidad. [<A
 HREF="try.html#kinney">1</A>]

<P>

<H2><A NAME="SECTION00012000000000000000">
Hacia el atonalismo de Schoenberg</A>
</H2>
		Fuertemente influido por Richard Wagner y Johannes Brahms desde su adolescencia, Schoenberg comenz&#243; componiendo al estilo posrom&#225;ntico de su &#233;poca, llevando el cromatismo y la orquestaci&#243;n hasta el extremo. Sin embargo, y no espont&#225;neamente, empez&#243; a buscar en sus composiciones que cada sonido tuviera valor por s&#237; mismo, un valor independiente de su funcionalidad tonal. 

<P>

<DIV ALIGN="CENTER">
			<DIV ALIGN="CENTER">

</DIV>
				<IMG
  WIDTH="119" HEIGHT="119" ALIGN="BOTTOM" BORDER="0"
 SRC="./Arnold_Schoenberg.jpg"
 ALT="Image Arnold_Schoenberg">
<BR>				Arnold Schoenberg
<BR>(1874-1951)	
		
</DIV>
		Para &#233;l, la m&#250;sica no estaba intr&#237;nsecamente dirigida a una t&#243;nica. En las progresiones, lo importante era el paso de un acorde a otro, y no hacia d&#243;nde se dirig&#237;an &#233;stos. Adem&#225;s, &#233;l opinaba que se deb&#237;an poder utilizar las notas de los modos eclesi&#225;sticos libremente, por lo que consideraba las notas no diat&#243;nicas tan v&#225;lidas como las diat&#243;nicas. Esto hac&#237;a imposible distinguir unas de otras, no pudiendo identificar apenas la t&#243;nica. De esta, y de otras muchas formas, Schoenberg consegu&#237;a que la jerarqu&#237;a tonal quedara desestabilizada. [<A
 HREF="try.html#kinney">1</A>]

<P>
De esta &#233;poca es su primera obra importante, <SPAN  CLASS="textit">Verkl&#228;rte Nacht</SPAN> (&#171;Noche transfigurada&#187;), Op. 4. Compuesto en 1899, este sexteto de cuerdas est&#225; inspirado por el poema hom&#243;nimo de Richard Dehmel. La m&#250;sica, seg&#250;n su autor, expresa el paseo de un hombre y una mujer en medio del abrazo de la naturaleza.  Aunque en la obra a&#250;n prevalece la armon&#237;a tradicional basada en acordes, Schoenberg sit&#250;a al oyente en un terreno de indefinici&#243;n tonal, no s&#243;lo en el plano arm&#243;nico sino tambi&#233;n en el mel&#243;dico. Adem&#225;s, hace uso del acorde de novena invertido, inexistente hasta entonces y, por tanto, rechazado por la cr&#237;tica. [<A
 HREF="try.html#diaz">2</A>]

<P>
Tras pasar por la etapa tonal posrom&#225;ntica, y debido a su convicci&#243;n en la irrevocabilidad de la evoluci&#243;n de la m&#250;sica hacia el cromatismo total [<A
 HREF="try.html#delgado">3</A>], en 1908 Schoenberg se deslig&#243; de la tonalidad completamente con el ciclo de canciones <SPAN  CLASS="textit">Das Buch der H&#228;ngenden G&#228;rten</SPAN>. A partir de entonces se dedic&#243; a componer fragmentos muy breves cuya estructura era definida por motivos y no por la armon&#237;a, como sol&#237;a ocurrir en formas musicales anteriores<A NAME="tex2html3"
  HREF="#foot82"><SUP><SPAN CLASS="arabic">3</SPAN></SUP></A>. A este periodo en sus composiciones se le llama <SPAN  CLASS="textit">atonalidad libre</SPAN>, aunque cabe destacar que Schoenberg rechazaba fervientemente este t&#233;rmino:

<P>
<BLOCKQUOTE>
<SPAN  CLASS="textit">La expresi&#243;n “m&#250;sica atonal” es de lo m&#225;s desafortunada - es como llamar a volar “el arte de no caer” o nadar “el arte de no ahogarse”.</SPAN><A NAME="tex2html4"
  HREF="#foot102"><SUP><SPAN CLASS="arabic">4</SPAN></SUP></A>
</BLOCKQUOTE>

<P>
A este periodo - es de 1912 - pertenece tambi&#233;n su famoso ciclo de canciones <SPAN  CLASS="textit">Pierrot Lunaire</SPAN>, Op. 21. Su nombre completo es &ldquo;Tres veces siete poemas de Pierrot Lunaire de Albert Giraud&rdquo;, ya que est&#225; dividida en 3 grupos de 7 canciones cada uno, cuyos textos son una selecci&#243;n de 21 poemas del ciclo hom&#243;nimo de Albert Giraud. 

<P>
Se encuentran en ella abundantes referencias al n&#250;mero 7: Schoenberg hace un uso extensivo de motivos de 7 notas a lo largo de la obra, mientras que el conjunto musical que la interpreta, incluyendo al director, consta de 7 miembros. De hecho, a este conjunto de instrumentos - flauta, clarinete, viol&#237;n, violonchelo, piano y cantante - se le ha dado el nombre de <SPAN  CLASS="textit">ensemble Pierrot</SPAN> en su honor. 

<P>
Otros n&#250;meros importantes en la obra son el 3 y el 13. Cada poema consta de 13 l&#237;neas, mientras que la primera l&#237;nea de cada poema aparece 3 veces: en las l&#237;neas 1, 7 y 13.

<P>
En esta obra no s&#243;lo hay una ausencia total de relaciones tonales, sino que el tratamiento vocal evita tambi&#233;n cualquier relaci&#243;n est&#233;tica con las t&#233;cnicas tradicionales: es un <SPAN  CLASS="textit">Sprechgesang</SPAN>, un canto hablado. De hecho, Schoenberg se refiere a estas piezas no como canciones, sino como melodramas. [<A
 HREF="try.html#diaz">2</A>]

<P>

<H2><A NAME="SECTION00013000000000000000">
El surgimiento de un sistema</A>
</H2>
		Schoenberg no estaba a&#250;n satisfecho con su t&#233;cnica compositiva, ya que admiraba las obras extensas de los m&#250;sicos rom&#225;nticos y pensaba que su atonalidad no pod&#237;a sostener una obra de gran envergadura. Es decir, necesitaba un hilo conductor mejor que los motivos para poder componer obras atonales m&#225;s largas.

<P>
Adem&#225;s, por aquella &#233;poca sufri&#243; una crisis en muchos aspectos de su vida. En lo personal, su mujer Matilde Zemlinsky acababa de abandonarlo por otro hombre, aunque posteriormente volver&#237;a junto al compositor. Y, en lo profesional, sus obras no eran del gusto del p&#250;blico, por lo que no contaba con suficiente dinero para mantener a su familia. Todas estas circunstancias, unidas al desarrollo de la Primera Guerra Mundial, no le permitieron componer apenas entre 1914 y 1923.

<P>
Tras el final de la guerra, en 1919, Schoenberg fund&#243; la Sociedad para Interpretaciones Musicales Privadas junto a sus disc&#237;pulos y amigos Alban Berg y Anton Webern. Schoenberg, Berg y Webern se autodenominaron la Segunda Escuela de Viena en honor al grupo de compositores del siglo XVIII Haydn, Mozart y Beethoven, quienes formaban la Primera Escuela de Viena.
<P>
En la Sociedad para Interpretaciones Musicales Privadas se presentaban m&#250;sicas contempor&#225;neas en circunstancias que favorecieran su adecuada apreciaci&#243;n. As&#237; se evitaba que dichas obras, al no ser entendidas por el p&#250;blico, fueran inmediatamente rechazadas. Las obras de compositores como Mahler, Debussy, Bart&#243;k, Ravel, Strauss y Stravinsky fueron incluidas en los programas de conciertos organizados por la Sociedad.

<P>
En este contexto Schoenberg pudo reflexionar sobre sus t&#233;cnicas compositivas, y al fin public&#243; en 1923 su ensayo <SPAN  CLASS="textit">M&#233;todo de composici&#243;n con doce sonidos</SPAN>, donde se describ&#237;an por primera vez los axiomas del dodecafonismo: la soluci&#243;n al problema de la atonalidad libre que le hab&#237;a estado atormentando durante una d&#233;cada.

<P>
Su primera obra &#237;ntegramente dodecaf&#243;nica, publicada tambi&#233;n en 1923, es la Suite para piano Op. 25. Es la pieza m&#225;s temprana en la que Schoenberg usa series dodecaf&#243;nicas en cada uno de los movimientos. En dos obras anteriores a ella usa series dodecaf&#243;nicas, pero en movimientos aislados: la Op. 23, <SPAN  CLASS="textit">5 St&#252;cke</SPAN> (1920-23), en el movimiento de Waltz final; y su <SPAN  CLASS="textit">Serenata</SPAN>, Op. 24, en su Soneto central.

<P>
Las series utilizadas en la Suite Op. 25 servir&#225;n de ejemplo en este texto, y su tercer movimiento, Musette, ser&#225; estudiado y analizado en el apartado <A HREF="#musette"><IMG  ALIGN="BOTTOM" BORDER="1" ALT="[*]"
 SRC="file:/usr/share/latex2html/icons/crossref.png"></A> con el fin de entender una obra dodecaf&#243;nica en toda su extensi&#243;n.
	

<H1><A NAME="SECTION00020000000000000000"></A><A NAME="ch:dodecafonismo"></A><BR>
EL SISTEMA DODECAF&#211;NICO DE SCHOENBERG
</H1>
	
<H2><A NAME="SECTION00021000000000000000">
Los postulados del dodecafonismo</A>
</H2>
		El dodecafonismo es un sistema compositivo que predetermina la melod&#237;a y la armon&#237;a a partir de una ordenaci&#243;n de las doce notas de la escala crom&#225;tica, que se llama <SPAN  CLASS="textit">serie</SPAN>. &#201;sta y algunas de sus transformaciones son los ladrillos con los que se construyen las alturas de las notas; son el &#250;nico material que se puede utilizar. [<A
 HREF="try.html#delgado">3</A>]

<P>
El resto de elementos de la pieza, como el n&#250;mero de instrumentos, el ritmo, el car&#225;cter, la textura o las din&#225;micas, se dejan a discreci&#243;n del compositor. No serializar todos los conjuntos ser&#225; la principal cr&#237;tica al dodecafonismo por parte de los compositores serialistas que sucedieron a su creador, Arnold Schoenberg. Para los serialistas integrales, como Pierre Boulez, aquello restaba cohesi&#243;n al modelo compositivo; para los dodecafonistas, aportaba libertad. [<A
 HREF="try.html#boulez">4</A>]

<P>
Precisamente la predeterminaci&#243;n dodecaf&#243;nica, aunque parece limitante, permite realizaciones musicales y estilos de composici&#243;n muy diferentes: Schoenberg daba un tratamiento tradicional a sus obras, ya que a&#250;n admiraba las formas cl&#225;sicas; Alban Berg iba m&#225;s all&#225; al utilizar series que recordaban a las tr&#237;adas tonales; y, en cambio, Anton Webern evitaba radicalmente cualquier asociaci&#243;n con la tradici&#243;n. [<A
 HREF="try.html#delgado">3</A>]

<P>
Schoenberg defini&#243; su sistema musical a partir de cuatro postulados que, en realidad, se basan en principios matem&#225;ticos [<A
 HREF="try.html#dominguez">5</A>]:

<P>
<SPAN  CLASS="textit">1. La serie <SPAN  CLASS="textit">[sobre la que se construye la obra dodecaf&#243;nica]</SPAN> consta de las doce notas de la escala crom&#225;tica dispuestas en un orden lineal espec&#237;fico.</SPAN>

<P>
<SPAN  CLASS="textit">2. Ninguna nota aparece m&#225;s de una vez en la serie.</SPAN>

<P>
Los dos primeros postulados expresan que una obra dodecaf&#243;nica fundamenta su estructura sobre una permutaci&#243;n de la escala de doce semitonos. Dicha permutaci&#243;n <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN> es una biyecci&#243;n del conjunto numerado de las doce notas {Do = 0, Do# = 1, Re = 2, Re# = 3, Mi = 4, Fa = 5, F# = 6, Sol = 7, Sol# = 8, La = 9, La# = 10, Si = 11} consigo mismo, y se representa de esta forma:

<P>

			
				&sigma#sigma;(0),&sigma#sigma;(1),&sigma#sigma;(2),&sigma#sigma;(3),&sigma#sigma;(4),&sigma#sigma;(5),&sigma#sigma;(6),&sigma#sigma;(7),&sigma#sigma;(8),&sigma#sigma;(9),&sigma#sigma;(10),&sigma#sigma;(11)
			
		

<P>
La permutaci&#243;n <SPAN CLASS="MATH"><IMG
 WIDTH="40" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img2.png"
 ALT="$ \sigma(m)$"></SPAN>, con <!-- MATH
 $m\in \mathbb{Z} / (12)$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="84" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img3.png"
 ALT="$ m\in \mathbb{Z} / (12)$"></SPAN><A NAME="tex2html5"
  HREF="#foot384"><SUP><SPAN CLASS="arabic">5</SPAN></SUP></A>, pertenece al grupo sim&#233;trico de orden 12: <SPAN CLASS="MATH"><IMG
 WIDTH="28" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img5.png"
 ALT="$ \sigma\in$"></SPAN> S<SPAN CLASS="MATH"><IMG
 WIDTH="17" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img6.png"
 ALT="$ _{12}$"></SPAN>. Por ejemplo, en la Suite para piano Op. 25 Schoenberg utiliza como serie original en todos los movimientos de la obra la siguiente permutaci&#243;n <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN>:

<P>
<P><!-- MATH
 \begin{displaymath}
\sigma=\drow{4,5,7,1,6,3,8,2,11,0,9,10}
\end{displaymath}
 -->
</P><DIV ALIGN="CENTER" CLASS="mathdisplay">
<IMG
 WIDTH="368" HEIGHT="54" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img7.png"
 ALT="$\displaystyle \sigma=\drow{4,5,7,1,6,3,8,2,11,0,9,10}$">
</DIV><P></P>	
		<DIV ALIGN="CENTER">
<IMG
  WIDTH="477" HEIGHT="50" ALIGN="BOTTOM" BORDER="0"
 SRC="./1.png"
 ALT="Image 1">
		
</DIV>

<P>
<SPAN  CLASS="textit">3. La serie ser&#225; expuesta en cualquiera de sus aspectos lineales: original, inversi&#243;n, retrogradaci&#243;n de la original y retrogradaci&#243;n de la inversi&#243;n.</SPAN>

<P>
<SPAN  CLASS="textit">4. La serie puede usarse en sus cuatro aspectos desde cualquier nota de la escala.</SPAN>

<P>
Los dos &#250;ltimos postulados ampl&#237;an los recursos compositivos al admitir la transformaci&#243;n de la serie original mediante <SPAN  CLASS="textit">inversi&#243;n</SPAN>, <SPAN  CLASS="textit">retrogradaci&#243;n</SPAN>, <SPAN  CLASS="textit">inversi&#243;n retr&#243;grada</SPAN> y <SPAN  CLASS="textit">transposici&#243;n</SPAN><A NAME="tex2html6"
  HREF="#foot185"><SUP><SPAN CLASS="arabic">6</SPAN></SUP></A>. El compositor puede utilizar cualquiera de las transformaciones de una serie al componer su obra dodecaf&#243;nica. El conjunto de series que puede utilizar, que viene dado por la serie original y todas sus posibles transformaciones, se conoce como <SPAN  CLASS="textit">espectro serial</SPAN>. [<A
 HREF="try.html#dominguez">5</A>]

<P>

<H2><A NAME="SECTION00022000000000000000"></A>
		<A NAME="transPsi"></A><BR>
Las transformaciones de una serie
</H2>
		Transformar una serie es matem&#225;ticamente equivalente a aplicar una funci&#243;n sobre la serie, y que asocie esa permutaci&#243;n a la permutaci&#243;n transformada. Por tanto, cualquier funci&#243;n transformativa <SPAN CLASS="MATH"><IMG
 WIDTH="16" HEIGHT="15" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img8.png"
 ALT="$ \Psi$"></SPAN> se aplica sobre el conjunto de las permutaciones, S<SPAN CLASS="MATH"><IMG
 WIDTH="17" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img6.png"
 ALT="$ _{12}$"></SPAN>.

<P>

<H3><A NAME="SECTION00022100000000000000">
Transposiciones</A>
</H3>
		La <SPAN  CLASS="textit">transposici&#243;n</SPAN>, mencionada en el cuarto postulado, consiste en subir o bajar la serie original un n&#250;mero determinado de semitonos. Por tanto, no se modifican los intervalos entre las notas, sino solamente la altura a la que est&#225; la serie. Ya que consideraremos todas las octavas equivalentes, debemos trabajar m&#243;dulo 12. 

<P>
La serie transportada k semitonos (con k constante),

<P>
<!-- MATH
 $\mbox{T}^{{\mbox{k}}}\left(\sigma\right)$
 -->
<SPAN CLASS="MATH">T<IMG
 WIDTH="38" HEIGHT="42" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img9.png"
 ALT="$ ^{{\mbox{k}}}\left(\sigma\right)$"></SPAN>, se construye sumando k a <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN> (mod. 12):
		<P><!-- MATH
 \begin{displaymath}
\mbox{T}^{{\mbox{k}}}\left(\sigma\left(m\right)\right)=\sigma\left(m\right)+{\mbox{k}}
\end{displaymath}
 -->
</P><DIV ALIGN="CENTER" CLASS="mathdisplay">
T<IMG
 WIDTH="154" HEIGHT="43" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img10.png"
 ALT="$\displaystyle ^{{\mbox{k}}}\left(\sigma\left(m\right)\right)=\sigma\left(m\right)+{\mbox{k}}$">
</DIV><P></P>		
		<!-- MATH
 $\mbox{T}^{{\mbox{k}}}=
		\left(\begin{array}{*{7}c}
			0&1&2&&9&10&11\\
			\sigma\left(0\right)+{\mbox{k}}&\sigma\left(1\right)+{\mbox{k}}&\sigma\left(2\right)+{\mbox{k}}&
			\cdots&
			\sigma\left(9\right)+{\mbox{k}}&\sigma\left(10\right)+{\mbox{k}}&\sigma\left(11\right)+{\mbox{k}}\\
		\end{array}\right)$
 -->
<SPAN CLASS="MATH">&nbsp; &nbsp;T<IMG
 WIDTH="565" HEIGHT="54" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img11.png"
 ALT="$ ^{{\mbox{k}}}=
\left(\begin{array}{*{7}c}
0&amp;1&amp;2&amp;&amp;9&amp;10&amp;11\\
\sigma\left(0\r...
...(10\right)+{\mbox{k}}&amp;\sigma\left(11\right)+{\mbox{k}}\\
\end{array}\right)
$"></SPAN>

<P>
A su vez, T<!-- MATH
 $^{\mbox{k}}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="22" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img12.png"
 ALT="$ ^{\mbox{k}}$"></SPAN> se forma al componer k transposiciones de 1 semitono: <!-- MATH
 $\mbox{T}^{\mbox{k}}=\mbox{T}^1\circ\mbox{T}^1\circ\ldots\circ\mbox{T}^1$
 -->
<SPAN CLASS="MATH">T<IMG
 WIDTH="154" HEIGHT="21" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img13.png"
 ALT="$ ^{\mbox{k}}=\mbox{T}^1\circ\mbox{T}^1\circ\ldots\circ\mbox{T}^1$"></SPAN>, k veces. Debido a que k es en realidad el exponente en la potencia de T, se coloca este n&#250;mero como super&#237;ndice.

<P>
Una posible serie transportada sobre la permutaci&#243;n <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN> de la Suite para piano Op. 25, con k <SPAN CLASS="MATH"><IMG
 WIDTH="28" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img14.png"
 ALT="$ = 6$"></SPAN>, es la siguiente serie T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>:
		<P><!-- MATH
 \begin{displaymath}
\mbox{T}^6=\drow{10,11,1,7,0,9,2,8,5,6,3,4}
\end{displaymath}
 -->
</P><DIV ALIGN="CENTER" CLASS="mathdisplay">
T<IMG
 WIDTH="374" HEIGHT="54" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img16.png"
 ALT="$\displaystyle ^6=\drow{10,11,1,7,0,9,2,8,5,6,3,4}$">
</DIV><P></P>	
		<DIV ALIGN="CENTER">
<IMG
  WIDTH="477" HEIGHT="55" ALIGN="BOTTOM" BORDER="0"
 SRC="./2.png"
 ALT="Image 2">
		
</DIV>

<P>

<H3><A NAME="SECTION00022200000000000000">
Retrogradaci&#243;n</A>
</H3>
		La <SPAN  CLASS="textit">retrogradaci&#243;n</SPAN> consiste en leer la serie original desde la nota final hacia atr&#225;s, es decir, aplicar a la serie una simetr&#237;a especular. De este modo, la primera nota ir&#225; al &#250;ltimo puesto, la segunda al pen&#250;ltimo, y as&#237; sucesivamente.

<P>
La serie retr&#243;grada se construye de esta forma:
		<P><!-- MATH
 \begin{displaymath}
\mbox{R}\left(\sigma\left(m\right)\right)=\sigma\left(-1-m\right)
\end{displaymath}
 -->
</P><DIV ALIGN="CENTER" CLASS="mathdisplay">
R<IMG
 WIDTH="154" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img17.png"
 ALT="$\displaystyle \left(\sigma\left(m\right)\right)=\sigma\left(-1-m\right)$">
</DIV><P></P>
		<!-- MATH
 $\mbox{R}=\drow{\sigma(11),\sigma(10),\sigma(9),\sigma(8),\sigma(7),\sigma(6),\sigma(5),\sigma(4),\sigma(3),\sigma(2),\sigma(1),\sigma(0)}$
 -->
<SPAN CLASS="MATH">R<IMG
 WIDTH="606" HEIGHT="54" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img18.png"
 ALT="$ =\drow{\sigma(11),\sigma(10),\sigma(9),\sigma(8),\sigma(7),\sigma(6),\sigma(5),\sigma(4),\sigma(3),\sigma(2),\sigma(1),\sigma(0)}$"></SPAN>

<P>
La serie retr&#243;grada sobre la permutaci&#243;n <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN> de la Suite Op. 25 es la siguiente serie R:	
		<P><!-- MATH
 \begin{displaymath}
\mbox{R}=\drow{10,9,0,11,2,8,3,6,1,7,5,4}
\end{displaymath}
 -->
</P><DIV ALIGN="CENTER" CLASS="mathdisplay">
R<IMG
 WIDTH="362" HEIGHT="54" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img19.png"
 ALT="$\displaystyle =\drow{10,9,0,11,2,8,3,6,1,7,5,4}$">
</DIV><P></P>		
		<DIV ALIGN="CENTER">
<IMG
  WIDTH="477" HEIGHT="50" ALIGN="BOTTOM" BORDER="0"
 SRC="./3.png"
 ALT="Image 3">
		
</DIV>

<P>

<H3><A NAME="SECTION00022300000000000000">
Inversi&#243;n</A>
</H3>
		La <SPAN  CLASS="textit">inversi&#243;n</SPAN> consiste en cambiar la direcci&#243;n -de ascendente a descendente, y viceversa- de los intervalos entre cada nota de la serie. Si el primer intervalo en la serie original <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN> es de <SPAN CLASS="MATH"><IMG
 WIDTH="25" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img20.png"
 ALT="$ +k$"></SPAN>, el primer intervalo en la serie invertida I ser&#225; de <SPAN CLASS="MATH"><IMG
 WIDTH="25" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img21.png"
 ALT="$ -k$"></SPAN> (mod. 12), por lo que debemos cambiar el signo de <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN> para construir I. Adem&#225;s, queremos que la primera nota de ambas series, I(0) y <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN>(0), coincidan, as&#237; que debemos transportar la serie (<SPAN CLASS="MATH"><IMG
 WIDTH="26" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img22.png"
 ALT="$ -\sigma$"></SPAN>) un n&#250;mero <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="15" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img23.png"
 ALT="$ \lambda$"></SPAN> de semitonos para que esta condici&#243;n se cumpla:
		<P></P>
<DIV ALIGN="CENTER" CLASS="mathdisplay"><TABLE CELLPADDING="0" WIDTH="100%" ALIGN="CENTER">
<TR VALIGN="MIDDLE">
<TD NOWRAP ALIGN="RIGHT"><SPAN CLASS="MATH">I<IMG
 WIDTH="119" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img24.png"
 ALT="$\displaystyle (0)=-\sigma\left(0\right)+\lambda$"></SPAN></TD>
<TD NOWRAP ALIGN="LEFT"><SPAN CLASS="MATH"><IMG
 WIDTH="53" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img25.png"
 ALT="$\displaystyle =\sigma\left(0\right)$"></SPAN></TD>
<TD NOWRAP CLASS="eqno" WIDTH="10" ALIGN="RIGHT">
&nbsp;&nbsp;&nbsp;</TD></TR>
<TR VALIGN="MIDDLE">
<TD NOWRAP ALIGN="RIGHT"><SPAN CLASS="MATH"><IMG
 WIDTH="52" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img26.png"
 ALT="$\displaystyle \implies \lambda$"></SPAN></TD>
<TD NOWRAP ALIGN="LEFT"><SPAN CLASS="MATH"><IMG
 WIDTH="58" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img27.png"
 ALT="$\displaystyle =2\sigma(0)$"></SPAN></TD>
<TD NOWRAP CLASS="eqno" WIDTH="10" ALIGN="RIGHT">
&nbsp;&nbsp;&nbsp;</TD></TR>
</TABLE></DIV>
<BR CLEAR="ALL"><P></P>
Por tanto, la serie invertida se construye de esta forma:
		<P><!-- MATH
 \begin{displaymath}
\mbox{I}\left(\sigma\left(m\right)\right)=-\sigma\left(m\right)+2\sigma\left(0\right)
\end{displaymath}
 -->
</P><DIV ALIGN="CENTER" CLASS="mathdisplay">
I<IMG
 WIDTH="187" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img28.png"
 ALT="$\displaystyle \left(\sigma\left(m\right)\right)=-\sigma\left(m\right)+2\sigma\left(0\right)$">
</DIV><P></P>
		<!-- MATH
 $\mbox{I}=\left(\begin{matrix}0&1&2&&10&11\\\sigma(0)&-\sigma(1)+2\sigma(0)&-\sigma(2)+2\sigma(0)&\ldots&-\sigma(10)+2\sigma(0)&-\sigma(11)+2\sigma(0)\\\end{matrix}\right)$
 -->
<SPAN CLASS="MATH">&nbsp; &nbsp;I<IMG
 WIDTH="583" HEIGHT="54" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img29.png"
 ALT="$ =\left(\begin{matrix}0&amp;1&amp;2&amp;&amp;10&amp;11\\ \sigma(0)&amp;-\sigma(1)+2\sigma(0)&amp;-\sigma(2)...
...a(0)&amp;\ldots&amp;-\sigma(10)+2\sigma(0)&amp;-\sigma(11)+2\sigma(0)\\ \end{matrix}\right)$"></SPAN>

<P>
La serie invertida sobre la permutaci&#243;n <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN> de la Suite Op. 25 es la siguiente serie I:
		<P><!-- MATH
 \begin{displaymath}
\mbox{I}=\drow{4,3,1,7,2,5,0,6,9,8,11,10}
\end{displaymath}
 -->
</P><DIV ALIGN="CENTER" CLASS="mathdisplay">
I<IMG
 WIDTH="346" HEIGHT="54" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img30.png"
 ALT="$\displaystyle =\drow{4,3,1,7,2,5,0,6,9,8,11,10}$">
</DIV><P></P>		
		<DIV ALIGN="CENTER">
<IMG
  WIDTH="477" HEIGHT="48" ALIGN="BOTTOM" BORDER="0"
 SRC="./4.png"
 ALT="Image 4">
		
</DIV>

<P>
En total, obtendremos 48 series - aunque no obligatoriamente distintas entre s&#237; - pertenecientes a un solo espectro serial. Hay 12 series originales sobre cada una de las doce notas, 12 series retr&#243;gradas, 12 invertidas y 12 series sobre las que se aplica tanto la retrogradaci&#243;n como la inversi&#243;n. A continuaci&#243;n se muestra la sintaxis simple junto a la matem&#225;tica:

<P>
			<SPAN ID="txt246">Sintaxis simple</SPAN>

<P>
T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img31.png"
 ALT="$ _0$"></SPAN>, T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img32.png"
 ALT="$ _1$"></SPAN>, T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img33.png"
 ALT="$ _2$"></SPAN>...

<P>
R<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img31.png"
 ALT="$ _0$"></SPAN>, R<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img32.png"
 ALT="$ _1$"></SPAN>, R<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img33.png"
 ALT="$ _2$"></SPAN>...

<P>
I<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img31.png"
 ALT="$ _0$"></SPAN>, I<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img32.png"
 ALT="$ _1$"></SPAN>, I<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img33.png"
 ALT="$ _2$"></SPAN>...

<P>
IR<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img31.png"
 ALT="$ _0$"></SPAN>, IR<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img32.png"
 ALT="$ _1$"></SPAN>, IR<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img33.png"
 ALT="$ _2$"></SPAN>...

<P>
<SPAN ID="txt247">Sintaxis matem&#225;tica</SPAN>

<P>
T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img34.png"
 ALT="$ ^0$"></SPAN>, T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img35.png"
 ALT="$ ^1$"></SPAN>, T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img36.png"
 ALT="$ ^2$"></SPAN>...

<P>
R, RT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img35.png"
 ALT="$ ^1$"></SPAN>, RT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img36.png"
 ALT="$ ^2$"></SPAN>...

<P>
I, IT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img35.png"
 ALT="$ ^1$"></SPAN>, IT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img36.png"
 ALT="$ ^2$"></SPAN>...

<P>
IR, IRT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img35.png"
 ALT="$ ^1$"></SPAN>, IRT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img36.png"
 ALT="$ ^2$"></SPAN>...

<P>

<H2><A NAME="SECTION00023000000000000000">
Matrices dodecaf&#243;nicas</A>
</H2>

<P>
Dada una serie, su matriz dodecaf&#243;nica es una representaci&#243;n visual de su espectro serial; es decir, del conjunto de series derivadas de esa serie. El espectro serial es todo el material compositivo sonoro del que se dispone para la composici&#243;n de una obra dodecaf&#243;nica. Al poder ordenar y disponer la informaci&#243;n en una tabla, el compositor puede acceder a toda ella al mismo tiempo sin tener que calcular cada serie individualmente.		

<P>
La matriz se lee en la direcci&#243;n en la que aparece el nombre de la serie. Las series T se leen de izquierda a derecha, mientras que las series R de derecha a izquierda. Las series I se leen de arriba a abajo y las IR/RI de abajo a arriba.

<P>
He creado un programa que devuelve en formato <SPAN CLASS="logo,LaTeX">L<SUP><SMALL>A</SMALL></SUP>T<SMALL>E</SMALL>X</SPAN> la matriz correspondiente a cualquier serie dodecaf&#243;nica que se introduzca en teclado, adem&#225;s de producir la nomenclatura simple para cada serie. El c&#243;digo, escrito en C++, est&#225; incluido en el Anexo <A HREF="#app:matrices"><IMG  ALIGN="BOTTOM" BORDER="1" ALT="[*]"
 SRC="file:/usr/share/latex2html/icons/crossref.png"></A>, p&#225;gina <A HREF="#app:matrices"><IMG  ALIGN="BOTTOM" BORDER="1" ALT="[*]"
 SRC="file:/usr/share/latex2html/icons/crossref.png"></A>.

<P>
A continuaci&#243;n, se incluye la matriz dodecaf&#243;nica de la serie P de la Suite Op. 25 de Schoenberg. Mientras que la mayor&#237;a de tablas tienen dos filas inferiores, que se corresponden con las distintas nomenclaturas de RI e IR para una misma serie – ya que normalmente no conmutan –, en la matriz de la serie P s&#237; coinciden
.

<P>
<!-- MATH
 $\begin{array}{l|cccccccccccc|r}
		&\mbox{I}_{0}&\mbox{I}_{1}&\mbox{I}_{3}&\mbox{I}_{9}&\mbox{I}_{2}&\mbox{I}_{11}&\mbox{I}_{4}&\mbox{I}_{10}&\mbox{I}_{7}&\mbox{I}_{8}&\mbox{I}_{5}&\mbox{I}_{6}&\\
		\hline
		\mbox{T}_{0}&4&5&7&1&6&3&8&2&11&0&9&10&\mbox{R}_{0}\\
		\mbox{T}_{11}&3&4&6&0&5&2&7&1&10&11&8&9&\mbox{R}_{11}\\
		\mbox{T}_{9}&1&2&4&10&3&0&5&11&8&9&6&7&\mbox{R}_{9}\\
		\mbox{T}_{3}&7&8&10&4&9&6&11&5&2&3&0&1&\mbox{R}_{3}\\
		\mbox{T}_{10}&2&3&5&11&4&1&6&0&9&10&7&8&\mbox{R}_{10}\\
		\mbox{T}_{1}&5&6&8&2&7&4&9&3&0&1&10&11&\mbox{R}_{1}\\
		\mbox{T}_{8}&0&1&3&9&2&11&4&10&7&8&5&6&\mbox{R}_{8}\\
		\mbox{T}_{2}&6&7&9&3&8&5&10&4&1&2&11&0&\mbox{R}_{2}\\
		\mbox{T}_{5}&9&10&0&6&11&8&1&7&4&5&2&3&\mbox{R}_{5}\\
		\mbox{T}_{4}&8&9&11&5&10&7&0&6&3&4&1&2&\mbox{R}_{4}\\
		\mbox{T}_{7}&11&0&2&8&1&10&3&9&6&7&4&5&\mbox{R}_{7}\\
		\mbox{T}_{6}&10&11&1&7&0&9&2&8&5&6&3&4&\mbox{R}_{6}\\
		\hline
		&\mbox{IR}_{0}&\mbox{IR}_{1}&\mbox{IR}_{3}&\mbox{IR}_{9}&\mbox{IR}_{2}&\mbox{IR}_{11}&\mbox{IR}_{4}&\mbox{IR}_{10}&\mbox{IR}_{7}&\mbox{IR}_{8}&\mbox{IR}_{5}&\mbox{IR}_{6}&\\
		\hline
		&\mbox{RI}_{0}&\mbox{RI}_{1}&\mbox{RI}_{3}&\mbox{RI}_{9}&\mbox{RI}_{2}&\mbox{RI}_{11}&\mbox{RI}_{4}&\mbox{RI}_{10}&\mbox{RI}_{7}&\mbox{RI}_{8}&\mbox{RI}_{5}&\mbox{RI}_{6}&
		\end{array}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="581" HEIGHT="295" BORDER="0"
 SRC="try-img37.png"
 ALT="\begin{displaymath}\begin{array}{l\vert cccccccccccc\vert r}
&amp;\mbox{I}_{0}&amp;\mbo...
...RI}_{7}&amp;\mbox{RI}_{8}&amp;\mbox{RI}_{5}&amp;\mbox{RI}_{6}&amp;
\end{array}\end{displaymath}"></SPAN>

<P>
Por otro lado, he escrito otro programa en el propio lenguaje <SPAN CLASS="logo,LaTeX">L<SUP><SMALL>A</SMALL></SUP>T<SMALL>E</SMALL>X</SPAN> que crea esta misma tabla con el comando <code>\dmatrix</code>, y tiene cualquier serie como argumento: <code>\dmatrix{4,5,7,1,6,3,8,2,11,0,9,10}</code>. El c&#243;digo se encuentra en el Anexo <A HREF="#app:latex"><IMG  ALIGN="BOTTOM" BORDER="1" ALT="[*]"
 SRC="file:/usr/share/latex2html/icons/crossref.png"></A>, p&#225;gina <A HREF="#app:latex1"><IMG  ALIGN="BOTTOM" BORDER="1" ALT="[*]"
 SRC="file:/usr/share/latex2html/icons/crossref.png"></A>. La tabla aparece sin el orlado de nomenclaturas:
		4,5,7,1,6,3,8,2,11,0,9,10

<P>
Tambi&#233;n he creado una p&#225;gina interactiva que genera matrices de cualquier serie para cualquier longitud serial, adem&#225;s de generar series aleatorias. Permite escoger entre dos numeraciones y dos nomenclaturas. Est&#225; escrita en Elm y el c&#243;digo puede encontrarse en <TT><A NAME="tex2html7"
  HREF="https://gitlab.com/dodecafonismo/matrices">https://gitlab.com/dodecafonismo/matrices</A></TT>.

<P>
En este enlace se encuentra la aplicaci&#243;n web. Sus instrucciones de uso se encuentran al final de la p&#225;gina: <TT><A NAME="tex2html8"
  HREF="https://matrices.netlify.com/">https://matrices.netlify.com/</A></TT>.
	

<H1><A NAME="SECTION00030000000000000000"></A><A NAME="ch:suite"></A><BR>
AN&#193;LISIS DE UNA OBRA DODECAF&#211;NICA: OP. 25
</H1>
	
<H2><A NAME="SECTION00031000000000000000">
Series de la Suite op. 25</A>
</H2>
		Lo primero que har&#225; un compositor dodecaf&#243;nico antes de empezar a componer ser&#225; escoger su serie original. Su elecci&#243;n nunca es una simple cuesti&#243;n de azar; al contrario, ya que las singularidades de la serie dar&#225;n un car&#225;cter especial a toda la obra. Por ejemplo, el compositor puede escoger una serie con simetr&#237;as, y as&#237; tendr&#225; series repetidas entre su espectro serial. Tambi&#233;n puede tener simetr&#237;as internas solo en un fragmento de tres o cuatro notas, y de este modo podr&#225; el compositor oscilar entre varias series del espectro que se parezcan entre s&#237;.<A NAME="tex2html9"
  HREF="#foot689"><SUP><SPAN CLASS="arabic">7</SPAN></SUP></A>
<P>
En la Suite para Piano Op. 25, Schoenberg escoge su serie <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN> para resaltar el intervalo de tritono (6 semitonos). A continuaci&#243;n se observan en negrita los intervalos entre las notas de esta serie, en unidad de semitono:

<P>
<!-- MATH
 $\left(\begin{array}{*{24}c}
			0&&1&&2&&3&&4&&5&&6&&7&&8&&9&&10&&11&\\
			4&\mathbf{1}&5&\mathbf{2}&7&\mathbf{6}&1&\mathbf{5}&6&\mathbf{9}&3&\mathbf{5}&8&\mathbf{6}&2&\mathbf{9}&11&\mathbf{1}&0&\mathbf{9}&9&\mathbf{1}&10&\mathbf{6}\end{array}\right)$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="634" HEIGHT="54" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img38.png"
 ALT="$ \left(\begin{array}{*{24}c}
0&amp;&amp;1&amp;&amp;2&amp;&amp;3&amp;&amp;4&amp;&amp;5&amp;&amp;6&amp;&amp;7&amp;&amp;8&amp;&amp;9&amp;&amp;10&amp;&amp;11&amp;\\
4&amp;\math...
...thbf{9}&amp;11&amp;\mathbf{1}&amp;0&amp;\mathbf{9}&amp;9&amp;\mathbf{1}&amp;10&amp;\mathbf{6}\end{array}\right)$"></SPAN>

<P>
Presenta repeticiones triples de los intervalos de tritono (6), de sexta mayor (9) y de segunda menor o semitono (1): los intervalos m&#225;s disonantes; una repetici&#243;n doble de cuarta justa (5), y un intervalo de segunda mayor (2); adem&#225;s de una consecuci&#243;n de intervalos repetida: 9 - 1 - 9 - 1. Como se forma el intervalo de tritono al enlazar la serie original con una serie que empiece por la misma nota, se tiene en cuenta el intervalo de tritono (6) al final. En el dodecafonismo se evitan deliberadamente los intervalos de tercera mayor (4), ya que estos son la base de la eludida armon&#237;a tonal. <A NAME="serie25"></A>
<P>
El intervalo de tritono tiene la particularidad de no modificarse en la inversi&#243;n y transportaci&#243;n k = 6, por lo que estos intervalos aparecen en los lugares originales, mientras que en los procedimientos de retrogradaci&#243;n y retrogradaci&#243;n inversa ocupan sus lugares en retr&#243;grado. En particular, Schoenberg utiliza entre los seis movimientos de la Suite solamente las ocho series de todo el espectro serial que cumplen estos requisitos: T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img34.png"
 ALT="$ ^0$"></SPAN>, T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>, I, IT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>, R, RT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>, RI y RIT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>, que podemos observar en el Anexo <A HREF="#app:series"><IMG  ALIGN="BOTTOM" BORDER="1" ALT="[*]"
 SRC="file:/usr/share/latex2html/icons/crossref.png"></A>, p&#225;gina <A HREF="#app:series"><IMG  ALIGN="BOTTOM" BORDER="1" ALT="[*]"
 SRC="file:/usr/share/latex2html/icons/crossref.png"></A>.

<P>
Estas series tienen muchos elementos en comun: todas comienzan o acaban por Mi<SPAN CLASS="MATH"><IMG
 WIDTH="10" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img39.png"
 ALT="$ \natural$"></SPAN> o por Si<SPAN CLASS="MATH"><IMG
 WIDTH="10" HEIGHT="17" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img40.png"
 ALT="$ \flat$"></SPAN>, lo que permite enlazar unas series con otras por medio del un&#237;sono o del tritono; se mantienen los intervalos de tritono en sus lugares originales o retr&#243;grados, y coinciden en las dos primeras y las dos &#250;ltimas notas dos a dos.

<P>
Se han realizado estudios - como el de Martha Hyde [<A
 HREF="try.html#hyde">7</A>] - en los que se limitan las series utilizadas en la Suite a cuatro: T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img34.png"
 ALT="$ ^0$"></SPAN>, T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>, I e IT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>, pero ya que el objetivo de este texto no es analizar la obra entera se dejar&#225; esta cuesti&#243;n para an&#225;lisis posteriores.

<P>

<H2><A NAME="SECTION00032000000000000000">
Descripci&#243;n de la Suite op. 25</A>
</H2>
		Schoenberg realiza en la serie <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN> una partici&#243;n triple; es decir, la serie se divide en tres tetracordios, y cada uno de ellos contiene un intervalo de tritono. El &#250;ltimo tetracordio, si se retrograda, consta de las notas 10 - 9 - 0 - 11, que en notaci&#243;n germ&#225;nica es la secuencia BACH. Esto puede ser un homenaje al compositor Johann Sebastian Bach (1685—1750), ya que Schoenberg admiraba a los grandes compositores anteriores a &#233;l por las estructuras formales de sus obras. [<A
 HREF="try.html#xiao">8</A>]

<P>
Otro posible homenaje a Bach y sus contempor&#225;neos barrocos es precisamente la forma de la obra: es una Suite, g&#233;nero cultivado durante los siglos XVII y XVIII que se compone de una variedad de danzas. La Suite de Schoenberg est&#225; formada por seis danzas: un Preludio, una Gavota, una Musette, un Intermezzo - que no tiene influencia barroca sino m&#225;s bien de Brahms, otro modelo para Schoenberg -, un Minueto con Tr&#237;o y una Giga. Adem&#225;s, el estilo, la textura - contrapunt&#237;stica, t&#237;picamente barroca - y la estructura de cada danza se corresponden con los estilos, texturas y estructuras de las danzas hom&#243;nimas del periodo bachiano.

<P>
Por ser &#233;sta su primera obra totalmente dodecaf&#243;nica, Schoenberg la utiliz&#243; como una muestra al mundo de las posibilidades de su nuevo m&#233;todo compositivo. Fue tambi&#233;n por lo que tom&#243; un formato tan variado como una Suite: as&#237; pod&#237;a en una misma obra componer con estilos tan distintos como los de las distintas danzas.

<P>
Al componer la obra, Schoenberg trata cada tetracordio como una subunidad individual. Los superpone contra otras series del espectro tambi&#233;n divididas, o utiliza sus notas como un solo acorde cuatr&#237;ada. Estas divisiones no s&#243;lo sirven para hacer la serie m&#225;s reconocible o a&#241;adir cohesi&#243;n a la obra, sino que adem&#225;s facilitan el desarrollo de la serie espec&#237;ficamente en el estilo de cada danza.

<P>

<H2><A NAME="SECTION00033000000000000000"></A>
	<A NAME="musette"></A><BR>
An&#225;lisis de la Musette
</H2>
		En el tercer movimiento de la Suite, la Musette, Schoenberg recrea la danza barroca que toma su nombre del instrumento hom&#243;nimo: la <SPAN  CLASS="textit">cornamusa</SPAN>, de la familia de la gaita. La m&#250;sica compuesta para estos instrumentos suele consistir en una melod&#237;a acompa&#241;ada por una nota pedal, que se traduce aqu&#237; en la presencia de un bord&#243;n sobre el Sol<SPAN CLASS="MATH"><IMG
 WIDTH="10" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img39.png"
 ALT="$ \natural$"></SPAN> (nota 7). Esta nota se extrae de cada una de las series utilizadas y se forma con ella un ostinato r&#237;tmico en la mano izquierda del piano. Con el resto de sonidos de cada serie, Schoenberg vuelve a emular el estilo de la danza barroca y articula un discurso polif&#243;nico a dos voces con ritmos esencialmente cortos.

<P>
A partir de la doble barra del comp&#225;s 9, el Re<SPAN CLASS="MATH"><IMG
 WIDTH="10" HEIGHT="17" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img40.png"
 ALT="$ \flat$"></SPAN> (nota 1) acompa&#241;a a Sol<SPAN CLASS="MATH"><IMG
 WIDTH="10" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img39.png"
 ALT="$ \natural$"></SPAN> y ambos crean un doble bord&#243;n en la mano izquierda. La elecci&#243;n de esas dos notas est&#225; estrechamente relacionada con la tradicional relaci&#243;n de quinta justa formada por Sol<SPAN CLASS="MATH"><IMG
 WIDTH="10" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img39.png"
 ALT="$ \natural$"></SPAN> y Re<SPAN CLASS="MATH"><IMG
 WIDTH="10" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img39.png"
 ALT="$ \natural$"></SPAN> en la m&#250;sica tonal. Schoenberg sustituye las quintas justas tonales por los tritonos dodecaf&#243;nicos, subrayando a&#250;n m&#225;s su &#171;emancipaci&#243;n de la disonancia&#187;.

<P>
Adem&#225;s de las similitudes texturales, r&#237;tmicas y arm&#243;nicas, la Musette de Schoenberg comparte estructura formal con las danzas barrocas. Y esta semejanza es quiz&#225;s la m&#225;s notable, ya que fue la b&#250;squeda de estructura formal lo que inspir&#243; a Schoenberg a desarrollar su m&#233;todo compositivo. La Musette barroca, como todos los movimientos de danza, presenta una estructura binaria con simetr&#237;a tonal: empieza y acaba por la misma tonalidad, mientras que el centro es zona de desarrollo. Schoenberg despoja de funcionalidad tonal a esa simetr&#237;a, madre de la forma sonata, y la aplica a su composici&#243;n dodecaf&#243;nica.

<P>
En este movimiento se pueden diferenciar a simple vista tres secciones, divididas en los compases 9 y 20, debido a cambios de textura, figuraci&#243;n y tempo. En la segunda secci&#243;n se le a&#241;ade melod&#237;a a la mano izquierda del piano, dejando m&#225;s camuflado el bord&#243;n que en la primera secci&#243;n, adem&#225;s de que &#233;ste se vuelve doble, mientras que vuelve a aparecer claramente en la tercera secci&#243;n. Tambi&#233;n en la segunda secci&#243;n aparece una nueva figuraci&#243;n, que es la semicorchea; y, por &#250;ltimo, en los dos compases de divisi&#243;n aparecen dos <SPAN  CLASS="textit">a tempo</SPAN>, que marcan el final de las dos primeras secciones tras dos zonas de variabilidad r&#237;tmica. [<A
 HREF="try.html#clercq">9</A>]

<P>
Para que esta estructura tr&#237;ptica sea una forma binaria, la primera y la &#250;ltima parte deben mantener un parecido, que se observa a trav&#233;s del an&#225;lisis de las series utilizadas en el movimiento. Estas series son T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img34.png"
 ALT="$ ^0$"></SPAN>, T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>, I e IT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>.

<P>
En la Musette, Schoenberg hace un uso casi absoluto de la tripartici&#243;n serial, hasta el punto de individualizar los tetracordios por separado y concederles privilegios seriales, como la retrogradaci&#243;n. Por ejemplo, en el comp&#225;s 7, en la voz inferior de la mano derecha aparece el tetracordio 4 - 5 - 2 - 3, que es o bien el primer tetracordio de RIT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN> o la retrogradaci&#243;n del tercer tetracordio de IT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>, mientras que los otros dos tetracordios de IT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>, 10 - 9 - 7<A NAME="tex2html10"
  HREF="#foot650"><SUP><SPAN CLASS="arabic">8</SPAN></SUP></A> - 1 en la voz superior y 8 - 11 - 6 - 0 en la mano izquierda, aparecen en el orden correcto. Entonces no se puede analizar el comp&#225;s como RIT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>, sino indicar que hay una alteraci&#243;n puntual de IT<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img15.png"
 ALT="$ ^6$"></SPAN>.

<P>
Por tanto, es muy complicado analizar esta obra en su totalidad, ya que la flexibilidad en la ordenaci&#243;n de los tetracordios puede generar situaciones muy ambiguas. Debido a estas fragmentaciones y a las variadas combinaciones de tetracordios originales y retr&#243;grados, se escucha un &#225;rea de desarrollo hacia la secci&#243;n media del movimiento. En cambio, las series al principio y al final de la pieza se presentan casi &#237;ntegramente, como una exposici&#243;n y reexposici&#243;n. He aqu&#237; un v&#237;nculo con la simetr&#237;a de las formas binarias tonales. [<A
 HREF="try.html#clercq">9</A>]

<P>
Es m&#225;s, incluso el orden de las series utilizadas en la primera y en la &#250;ltima secci&#243;n coinciden, exceptuando dos repeticiones consecutivas y las series T<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img34.png"
 ALT="$ ^0$"></SPAN> finales, que act&#250;an como una cadencia serial:

<P>
<!-- MATH
 $\begin{array}{*{12}c}
			\mathbf{c}.\mathbf{1}&\text{T}^0&\text{IT}^6&\text{T}^6&\text{I}&\text{T}^0&\text{I}&\text{T}^6&
				\begin{matrix}\text{IT}^6&\text{IT}^6\\
				\end{matrix}
			&&&\mathbf{c}.\mathbf{9}\\
			\mathbf{c}.\mathbf{22}&\text{T}^0&\text{IT}^6&\text{T}^6&\text{I}&\text{T}^0&
				\begin{matrix}
				\text{I}&\text{I}\\
				\end{matrix}
			&\text{T}^6&\text{IT}^6&\text{T}^0&\text{T}^0&\mathbf{c}.\mathbf{31}\\\end{array}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="470" HEIGHT="57" BORDER="0"
 SRC="try-img41.png"
 ALT="\begin{displaymath}\begin{array}{*{12}c}
\mathbf{c}.\mathbf{1}&amp;\text{T}^0&amp;\text...
...T}^6&amp;\text{T}^0&amp;\text{T}^0&amp;\mathbf{c}.\mathbf{31}\\ \end{array}\end{displaymath}"></SPAN>

<P>
En el Anexo <A HREF="#app:score"><IMG  ALIGN="BOTTOM" BORDER="1" ALT="[*]"
 SRC="file:/usr/share/latex2html/icons/crossref.png"></A>, p&#225;gina <A HREF="#app:score"><IMG  ALIGN="BOTTOM" BORDER="1" ALT="[*]"
 SRC="file:/usr/share/latex2html/icons/crossref.png"></A>, se encuentra el an&#225;lisis serial completo de la Musette.
	
<H1><A NAME="SECTION00040000000000000000"></A><A NAME="ch:permutaciones"></A><BR>
INTRODUCCI&#211;N MATEM&#193;TICA
</H1>
	
<H2><A NAME="SECTION00041000000000000000">
Conjuntos y grupos</A>
</H2>
		Un <SPAN  CLASS="textit">conjunto</SPAN> es una colecci&#243;n de objetos bien definidos y distintos entre s&#237; que se llaman <SPAN  CLASS="textit">elementos</SPAN>. 

<P>
Para definir un conjunto se puede o bien listar los objetos uno a uno, o bien describirlos por medio de un predicado: una o varias propiedades que caracterizan a todos los elementos de dicho conjunto.

<P>
Por ejemplo, el conjunto K<!-- MATH
 $_{\mbox{i}}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="9" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img42.png"
 ALT="$ _{\mbox{i}}$"></SPAN>, formado por las doce notas de la escala crom&#225;tica de una misma octava i, est&#225; bien definido porque podemos hacer una lista con ellas: por ejemplo, <!-- MATH
 $\mbox{K}_{\mbox{4}} =$
 -->
<SPAN CLASS="MATH">K<IMG
 WIDTH="29" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img43.png"
 ALT="$ _{\mbox{4}} = $"></SPAN>

<P>
<!-- MATH
 $\{\mbox{Do}_{\mbox{4}}, \mbox{Do\#}_{\mbox{4}}, \mbox{Re}_{\mbox{4}}, \mbox{Re\#}_{\mbox{4}}, \mbox{Mi}_{\mbox{4}}, \mbox{Fa}_{\mbox{4}}, \mbox{Fa\#}_{\mbox{4}}, \mbox{Sol}_{\mbox{4}}, \mbox{Sol\#}_{\mbox{4}}, \mbox{La}_{\mbox{4}}, \mbox{La\#}_{\mbox{4}}, \mbox{Si}_{\mbox{4}}\}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="12" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img44.png"
 ALT="$ \{$">Do<IMG
 WIDTH="463" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img45.png"
 ALT="$ _{\mbox{4}}, \mbox{Do\char93 }_{\mbox{4}}, \mbox{Re}_{\mbox{4}}, \mbox{Re\char...
...4}}, \mbox{La}_{\mbox{4}}, \mbox{La\char93 }_{\mbox{4}}, \mbox{Si}_{\mbox{4}}\}$"></SPAN>

<P>
Por un lado, aun llamando a las notas de distinta manera, el conjunto, conceptualmente, es el mismo. Adem&#225;s, el hecho de listar alg&#250;n elemento m&#225;s de una vez no afecta a su definici&#243;n. Como <!-- MATH
 $\mbox{Do\#}_{\mbox{4}} = \mbox{Re}\flat_{\mbox{4}}$
 -->
<SPAN CLASS="MATH">Do#<IMG
 WIDTH="67" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img46.png"
 ALT="$ _{\mbox{4}} = \mbox{Re}\flat_{\mbox{4}}$"></SPAN>,<A NAME="tex2html11"
  HREF="#foot830"><SUP><SPAN CLASS="arabic">9</SPAN></SUP></A>  <!-- MATH
 $\mbox{K}_{\mbox{4}}$
 -->
<SPAN CLASS="MATH">K<IMG
 WIDTH="12" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img47.png"
 ALT="$ _{\mbox{4}}$"></SPAN> tambi&#233;n puede ser listado as&#237;:

<P>
<!-- MATH
 $\{\mbox{Do}_{\mbox{4}}, \mbox{Do\#}_{\mbox{4}}, \mbox{Re}\flat_{\mbox{4}}, \mbox{Re}_{\mbox{4}}, \mbox{Re\#}_{\mbox{4}}, \mbox{Mi}_{\mbox{4}}, \mbox{Fa}_{\mbox{4}}, \mbox{Fa\#}_{\mbox{4}}, \mbox{Sol}_{\mbox{4}}, \mbox{Sol\#}_{\mbox{4}}, \mbox{La}_{\mbox{4}}, \mbox{La\#}_{\mbox{4}}, \mbox{Si}_{\mbox{4}}\}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="12" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img44.png"
 ALT="$ \{$">Do<IMG
 WIDTH="504" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img48.png"
 ALT="$ _{\mbox{4}}, \mbox{Do\char93 }_{\mbox{4}}, \mbox{Re}\flat_{\mbox{4}}, \mbox{Re...
...4}}, \mbox{La}_{\mbox{4}}, \mbox{La\char93 }_{\mbox{4}}, \mbox{Si}_{\mbox{4}}\}$"></SPAN>

<P>
En cambio, el conjunto D, formado por las duraciones r&#237;tmicas elementales - sin ligaduras ni puntillos -, es infinito, por lo que no se puede listar de forma completa. Sin embargo, se puede expresar por medio de un predicado:

<P>
<!-- MATH
 $\mbox{D} =\{2^n:n\in\mathbb{Z},\ n\le 2\} = \{4,\ 2,\ 1,\ \frac{1}{2},\ \frac{1}{4},\ \frac{1}{8},\ \ldots\} = \{\fullnote,\ \halfnote,\ \quarternote,\ \eighthnote,\ \ldots\}$
 -->
<SPAN CLASS="MATH">D<IMG
 WIDTH="472" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img49.png"
 ALT="$ =\{2^n:n\in\mathbb{Z},\ n\le 2\} = \{4,\ 2,\ 1,\ \frac{1}{2},\ \frac{1}{4},\ \...
...8},\ \ldots\} = \{\fullnote,\ \halfnote,\ \quarternote,\ \eighthnote,\ \ldots\}$"></SPAN>

<P>
La notaci&#243;n <!-- MATH
 $n\in\mathbb{Z}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="43" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img50.png"
 ALT="$ n\in\mathbb{Z}$"></SPAN> significa que <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img51.png"
 ALT="$ n$"></SPAN> pertenece a los n&#250;meros enteros. En este caso se han representado las duraciones mediante su ratio con la duraci&#243;n de la negra <!-- MATH
 $\quarternote$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="9" HEIGHT="15" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img52.png"
 ALT="$ \quarternote$"></SPAN>.

<P>
Los elementos de un conjunto pueden combinarse mediante <SPAN  CLASS="textit">operaciones</SPAN> - como la suma o la multiplicaci&#243;n en el caso de los n&#250;meros - para dar otros objetos matem&#225;ticos. 

<P>
Se dice que un conjunto G no vac&#237;o y una operaci&#243;n binaria (<SPAN CLASS="MATH"><IMG
 WIDTH="12" HEIGHT="13" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img53.png"
 ALT="$ \ast$"></SPAN>) forman la estructura de un <SPAN  CLASS="textit">grupo</SPAN> (G, <SPAN CLASS="MATH"><IMG
 WIDTH="12" HEIGHT="13" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img53.png"
 ALT="$ \ast$"></SPAN>) cuando cumplen:

<P>

<OL>
<LI>Su operaci&#243;n es interna: Si <SPAN CLASS="MATH"><IMG
 WIDTH="41" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img54.png"
 ALT="$ a,b\in$"></SPAN> G, entonces <!-- MATH
 $a\ast b\in$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="49" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img55.png"
 ALT="$ a\ast b\in$"></SPAN> G.		
</LI>
<LI>Su operaci&#243;n es asociativa: Si <SPAN CLASS="MATH"><IMG
 WIDTH="55" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img56.png"
 ALT="$ a,b,c\in$"></SPAN> G, <!-- MATH
 $(a\ast b)\ast c=a\ast(b\ast c)$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="154" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img57.png"
 ALT="$ (a\ast b)\ast c=a\ast(b\ast c)$"></SPAN>. 
</LI>
<LI>Existe un elemento <SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img58.png"
 ALT="$ e$"></SPAN> en G, llamado elemento neutro o identidad, tal que para todo <SPAN CLASS="MATH"><IMG
 WIDTH="28" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img59.png"
 ALT="$ x\in$"></SPAN> G se cumple que <!-- MATH
 $e\ast x = x\ast e = x$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="118" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img60.png"
 ALT="$ e\ast x = x\ast e = x$"></SPAN>. Se puede probar que el neutro es &#250;nico para cada grupo. A veces se incluye dentro de la definici&#243;n del grupo: (G, <SPAN CLASS="MATH"><IMG
 WIDTH="12" HEIGHT="13" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img53.png"
 ALT="$ \ast$"></SPAN>, <SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img58.png"
 ALT="$ e$"></SPAN>).
</LI>
<LI>Cada <SPAN CLASS="MATH"><IMG
 WIDTH="28" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img59.png"
 ALT="$ x\in$"></SPAN> G tiene asociado otro elemento <SPAN CLASS="MATH"><IMG
 WIDTH="45" HEIGHT="33" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img61.png"
 ALT="$ x^{-1}\in$"></SPAN> G, llamado elemento inverso, tal que <!-- MATH
 $x \ast x^{-1} = x^{-1}  \ast x = e$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="154" HEIGHT="18" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img62.png"
 ALT="$ x \ast x^{-1} = x^{-1} \ast x = e$"></SPAN>. Se puede probar que el inverso de cada elemento es &#250;nico.		
		
</LI>
</OL>

<P>
(<!-- MATH
 $\mathbb{Z},+,0$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="49" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img63.png"
 ALT="$ \mathbb{Z},+,0$"></SPAN>) y (<!-- MATH
 $\mathbb{Q},+,0$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="51" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img64.png"
 ALT="$ \mathbb{Q},+,0$"></SPAN>) son grupos, pero (<!-- MATH
 $\mathbb{N},+,0$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="50" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img65.png"
 ALT="$ \mathbb{N},+,0$"></SPAN>) no porque no existe el <SPAN  CLASS="textit">inverso</SPAN> de 2 con la suma: <!-- MATH
 $-2\notin\mathbb{N}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="55" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img66.png"
 ALT="$ -2\notin\mathbb{N}$"></SPAN>. (<!-- MATH
 $\mathbb{R},*,1$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="45" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img67.png"
 ALT="$ \mathbb{R},*,1$"></SPAN>) y (<!-- MATH
 $\mathbb{Q},*,1$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="46" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img68.png"
 ALT="$ \mathbb{Q},*,1$"></SPAN>) son grupos, pero (<!-- MATH
 $\mathbb{Z},*,1$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="44" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img69.png"
 ALT="$ \mathbb{Z},*,1$"></SPAN>) no porque no existe el <SPAN  CLASS="textit">inverso</SPAN> de 2 con la multiplicaci&#243;n: <!-- MATH
 $\frac12\notin\mathbb{Z}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="44" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img70.png"
 ALT="$ \frac12\notin\mathbb{Z}$"></SPAN>.

<P>

<H2><A NAME="SECTION00042000000000000000">
Funciones y permutaciones</A>
</H2>
		Una <SPAN  CLASS="textit">funci&#243;n</SPAN> es una regla que asocia a cada elemento de un primer conjunto, llamado <SPAN  CLASS="textit">dominio</SPAN>, un &#250;nico elemento de un segundo conjunto. Si la funci&#243;n se llama <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img71.png"
 ALT="$ f$"></SPAN>, el dominio A y el segundo conjunto B, se denota <!-- MATH
 $f:\mbox{A}\to \mbox{B}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="22" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img72.png"
 ALT="$ f:$">A<IMG
 WIDTH="20" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img73.png"
 ALT="$ \to$">&nbsp; &nbsp;B</SPAN>. El elemento asociado a un <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img74.png"
 ALT="$ x$"></SPAN> mediante <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img71.png"
 ALT="$ f$"></SPAN> se denota <SPAN CLASS="MATH"><IMG
 WIDTH="35" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img75.png"
 ALT="$ f(x)$"></SPAN>.

<P>
Todos los <SPAN CLASS="MATH"><IMG
 WIDTH="28" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img59.png"
 ALT="$ x\in$"></SPAN> A tienen que estar asociados a un <SPAN CLASS="MATH"><IMG
 WIDTH="50" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img76.png"
 ALT="$ f(x)\in$"></SPAN> B, pero no todos los elementos de B tienen un elemento de A asociado. Los elementos de B que s&#237; lo cumplen, es decir, los que se pueden escribir como <SPAN CLASS="MATH"><IMG
 WIDTH="35" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img75.png"
 ALT="$ f(x)$"></SPAN> para alg&#250;n <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img74.png"
 ALT="$ x$"></SPAN>, forman el conjunto <SPAN  CLASS="textit">imagen</SPAN> de la funci&#243;n: <!-- MATH
 $im(f)=\{\ y\in \mbox{B}:\ \exists\ x \in \mbox{A},\ f(x)=y\ \}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="103" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img77.png"
 ALT="$ im(f)=\{\ y\in$">&nbsp; &nbsp;B<IMG
 WIDTH="56" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img78.png"
 ALT="$ :\ \exists\ x \in$">&nbsp; &nbsp;A<IMG
 WIDTH="90" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img79.png"
 ALT="$ ,\ f(x)=y\ \}$"></SPAN>

<P>
Cuando varias funciones se aplican una detr&#225;s de la otra decimos que realizamos la operaci&#243;n de <SPAN  CLASS="textit">composici&#243;n de funciones</SPAN>. Se representa con el s&#237;mbolo <SPAN CLASS="MATH"><IMG
 WIDTH="12" HEIGHT="15" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img80.png"
 ALT="$ \circ$"></SPAN>. La imagen de la primera funci&#243;n ser&#225; el dominio de la segunda, y as&#237; sucesivamente. Por ejemplo, aplicar una funci&#243;n <SPAN CLASS="MATH"><IMG
 WIDTH="35" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img75.png"
 ALT="$ f(x)$"></SPAN> y despu&#233;s aplicar una funci&#243;n <SPAN CLASS="MATH"><IMG
 WIDTH="33" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img81.png"
 ALT="$ g(x)$"></SPAN> se denota <!-- MATH
 $g(f(x))=(g\circ f)(x)$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="143" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img82.png"
 ALT="$ g(f(x))=(g\circ f)(x)$"></SPAN>.

<P>
Una <SPAN  CLASS="textit">permutaci&#243;n</SPAN> <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN>(X) es una funci&#243;n sobre un conjunto X que asocia sus elementos a los elementos del mismo conjunto X de manera un&#237;voca. Es decir, asocia cada elemento a uno, y solo uno, de los elementos de su mismo conjunto (<!-- MATH
 $\sigma:\mbox{X}\to \mbox{X}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="22" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img83.png"
 ALT="$ \sigma:$">X<IMG
 WIDTH="20" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img73.png"
 ALT="$ \to$">&nbsp; &nbsp;X</SPAN>).

<P>
El conjunto de todas las posibles permutaciones sobre un determinado conjunto X, junto con la operaci&#243;n de composici&#243;n de funciones (<SPAN CLASS="MATH"><IMG
 WIDTH="12" HEIGHT="15" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img80.png"
 ALT="$ \circ$"></SPAN>), forma un grupo denotado por S<!-- MATH
 $_{\mbox{x}}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img84.png"
 ALT="$ _{\mbox{x}}$"></SPAN>. Para probarlo, se debe comprobar que cumple todas las propiedades de los grupos.

<P>

<OL>
<LI>Permutar dos veces es tambi&#233;n una permutaci&#243;n.
</LI>
<LI>La composici&#243;n de funciones es asociativa.
</LI>
<LI>La permutaci&#243;n que asigna un elemento a s&#237; mismo es la funci&#243;n identidad.
</LI>
<LI>Como las permutaciones son biyectivas, cada una tiene una inversa que es tambi&#233;n una permutaci&#243;n.		
		
</LI>
</OL>

<P>
Cuando X es el conjunto de n&#250;meros naturales desde 1 hasta <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img51.png"
 ALT="$ n$"></SPAN>, el grupo S<!-- MATH
 $_{\mbox{x}}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img84.png"
 ALT="$ _{\mbox{x}}$"></SPAN> se representa como S<SPAN CLASS="MATH"><IMG
 WIDTH="12" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img85.png"
 ALT="$ _n$"></SPAN> y se le denomina el grupo sim&#233;trico de orden <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img51.png"
 ALT="$ n$"></SPAN>. El n&#250;mero de elementos en S<SPAN CLASS="MATH"><IMG
 WIDTH="12" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img85.png"
 ALT="$ _n$"></SPAN>, es decir, de posibles permutaciones de <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img51.png"
 ALT="$ n$"></SPAN> n&#250;meros, es <SPAN CLASS="MATH"><IMG
 WIDTH="18" HEIGHT="15" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img86.png"
 ALT="$ n!$"></SPAN>. 

<P>
En los ejemplos musicales de este texto, los conjuntos estar&#225;n numerados desde 0 hasta <SPAN CLASS="MATH"><IMG
 WIDTH="41" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img87.png"
 ALT="$ n-1$"></SPAN>, siendo <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img51.png"
 ALT="$ n$"></SPAN> el n&#250;mero de elementos a permutar, en vez de desde 1 hasta <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img51.png"
 ALT="$ n$"></SPAN>. Seguir&#225;n siendo grupos sim&#233;tricos de orden <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img51.png"
 ALT="$ n$"></SPAN>, pero con una numeraci&#243;n distinta.

<P>
La notaci&#243;n utilizada para representar una permutaci&#243;n <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN> perteneciente a S<SPAN CLASS="MATH"><IMG
 WIDTH="12" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img85.png"
 ALT="$ _n$"></SPAN> con la numeraci&#243;n desde 0 y con <SPAN CLASS="MATH"><IMG
 WIDTH="40" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img2.png"
 ALT="$ \sigma(m)$"></SPAN> siendo el elemento asociado a <SPAN CLASS="MATH"><IMG
 WIDTH="18" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img88.png"
 ALT="$ m$"></SPAN> mediante <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img1.png"
 ALT="$ \sigma$"></SPAN>, es:
		<P><!-- MATH
 \begin{displaymath}
\sigma=\left(\begin{matrix}0&1&2&&n-3&n-2&n-1\\\sigma\left(0\right)&\sigma\left(1\right)&\sigma\left(2\right)&\cdots&\sigma\left(n-3\right)&\sigma\left(n-2\right)&\sigma\left(n-1\right)\\\end{matrix}\right)
\end{displaymath}
 -->
</P><DIV ALIGN="CENTER" CLASS="mathdisplay">
<IMG
 WIDTH="458" HEIGHT="54" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img89.png"
 ALT="$\displaystyle \sigma=\left(\begin{matrix}0&amp;1&amp;2&amp;&amp;n-3&amp;n-2&amp;n-1\\ \sigma\left(0\rig...
...(n-3\right)&amp;\sigma\left(n-2\right)&amp;\sigma\left(n-1\right)\\ \end{matrix}\right)$">
</DIV><P></P>

<P>

<H2><A NAME="SECTION00043000000000000000">
Aritm&#233;tica modular</A>
</H2>
		Fijado un <!-- MATH
 $n\in\mathbb{N}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="44" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img90.png"
 ALT="$ n\in\mathbb{N}$"></SPAN>, se dice que <SPAN CLASS="MATH"><IMG
 WIDTH="12" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img91.png"
 ALT="$ a$"></SPAN> y <SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="15" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img92.png"
 ALT="$ b$"></SPAN> son <SPAN  CLASS="textit">congruentes</SPAN> (o equivalentes) m&#243;dulo <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img51.png"
 ALT="$ n$"></SPAN> si tienen el mismo resto al dividirlos entre <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img51.png"
 ALT="$ n$"></SPAN>; es decir, que todos los n&#250;meros con el mismo resto se agrupan y se toman como equivalentes. Se expresa como <SPAN CLASS="MATH"><IMG
 WIDTH="40" HEIGHT="15" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img93.png"
 ALT="$ a\equiv b$"></SPAN> (mod. <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img51.png"
 ALT="$ n$"></SPAN>).

<P>
De esta forma se pueden operar entre s&#237; los n&#250;meros del 0 al <SPAN CLASS="MATH"><IMG
 WIDTH="41" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img87.png"
 ALT="$ n-1$"></SPAN>, ya que se conservan las operaciones de los n&#250;meros enteros, y si un resultado es <SPAN CLASS="MATH"><IMG
 WIDTH="30" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img94.png"
 ALT="$ \geq n$"></SPAN> se puede seguir dividiendo entre <SPAN CLASS="MATH"><IMG
 WIDTH="13" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img51.png"
 ALT="$ n$"></SPAN> para que cumpla <SPAN CLASS="MATH"><IMG
 WIDTH="71" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img95.png"
 ALT="$ 0\leq r&lt;n$"></SPAN>.

<P>
Se conserva la suma (y la resta), ya que si <!-- MATH
 $a=nq_a+r_a$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="92" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img96.png"
 ALT="$ a=nq_a+r_a$"></SPAN> y <!-- MATH
 $b=nq_b+r_b$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="88" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img97.png"
 ALT="$ b=nq_b+r_b$"></SPAN>, entonces <!-- MATH
 $a+b=(nq_a+r_a)+(nq_b+r_b)=n(q_a+q_b)+(r_a+r_b)$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="389" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img98.png"
 ALT="$ a+b=(nq_a+r_a)+(nq_b+r_b)=n(q_a+q_b)+(r_a+r_b)$"></SPAN>, as&#237; que el resto de <SPAN CLASS="MATH"><IMG
 WIDTH="38" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img99.png"
 ALT="$ a+b$"></SPAN> es igual al de <SPAN CLASS="MATH"><IMG
 WIDTH="52" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img100.png"
 ALT="$ r_a+r_b$"></SPAN>.

<P>
La <SPAN  CLASS="textit">aritm&#233;tica modular</SPAN> tambi&#233;n se llama aritm&#233;tica del reloj, porque funciona de la misma manera que las horas en un reloj. Como el 3 tiene el mismo resto entre 12 que el 15, las 15h son las 3h: <SPAN CLASS="MATH"><IMG
 WIDTH="49" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img101.png"
 ALT="$ 3\equiv15$"></SPAN> (mod. <SPAN CLASS="MATH"><IMG
 WIDTH="20" HEIGHT="13" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img102.png"
 ALT="$ 12$"></SPAN>). O, por ejemplo, 2 horas despu&#233;s de las 11 dan las 13, es decir, la 1: <!-- MATH
 $2+11=13\equiv1$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="113" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img103.png"
 ALT="$ 2+11=13\equiv1$"></SPAN> (mod. <SPAN CLASS="MATH"><IMG
 WIDTH="20" HEIGHT="13" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img102.png"
 ALT="$ 12$"></SPAN>). 

<P>
Tambi&#233;n se conserva la multiplicaci&#243;n: si <!-- MATH
 $a=nq_a+r_a$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="92" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img96.png"
 ALT="$ a=nq_a+r_a$"></SPAN> y <!-- MATH
 $b=nq_b+r_b$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="88" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img97.png"
 ALT="$ b=nq_b+r_b$"></SPAN>, entonces <!-- MATH
 $ab=(nq_a+r_a)(nq_b+r_b)=n^2q_aq_b+nq_ar_b+nq_br_a+r_ar_b=n(nq_aq_b+q_ar_b+q_br_a)+r_ar_b$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="631" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img104.png"
 ALT="$ ab=(nq_a+r_a)(nq_b+r_b)=n^2q_aq_b+nq_ar_b+nq_br_a+r_ar_b=n(nq_aq_b+q_ar_b+q_br_a)+r_ar_b$"></SPAN>, as&#237; que el resto de <SPAN CLASS="MATH"><IMG
 WIDTH="19" HEIGHT="15" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img105.png"
 ALT="$ ab$"></SPAN> es igual al de <SPAN CLASS="MATH"><IMG
 WIDTH="32" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img106.png"
 ALT="$ r_ar_b$"></SPAN>.

<P>
En m&#250;sica, la aritm&#233;tica modular se puede encontrar en las escalas: todas las notas Do se toman como equivalentes, por ejemplo, y al sumarle 12 semitonos (una octava) se vuelve a obtener un Do. Si se asocian los n&#250;meros del 0 al 11 a las notas crom&#225;ticas del Do al Si, entonces <!-- MATH
 $0+12=12\equiv0$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="113" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img107.png"
 ALT="$ 0+12=12\equiv0$"></SPAN> (mod. <SPAN CLASS="MATH"><IMG
 WIDTH="20" HEIGHT="13" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img102.png"
 ALT="$ 12$"></SPAN>).

<P>
	 
<H2><A NAME="SECTION00050000000000000000">
Bibliography</A>
</H2><DL COMPACT><DD>
<P>
<P></P><DT><A NAME="kinney">1</A>
<DD>
			Kinney, James P. 
			<SPAN  CLASS="textit">Twelve-tone Serialism: Exploring the Works of Anton Webern</SPAN>,
			Undergraduate Honors Theses.
			Paper 1
			(2015)

<P>
<P></P><DT><A NAME="diaz">2</A>
<DD>
			Díaz de la Fuente, Alicia. 
			<SPAN  CLASS="textit">Estructura y significado en la música serial y aleatoria</SPAN>,
			Universidad Nacional de Educación a Distancia.
			Tesis Doctoral en Filosofía
			(2005)			

<P>
<P></P><DT><A NAME="delgado">3</A>
<DD>
			Delgado García, Fernando. 
			Clases y material de Historia de la Música, 5<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="16" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img108.png"
 ALT="$ ^{\circ}$"></SPAN> y 6<SPAN CLASS="MATH"><IMG
 WIDTH="11" HEIGHT="16" ALIGN="BOTTOM" BORDER="0"
 SRC="try-img108.png"
 ALT="$ ^{\circ}$"></SPAN> de Enseñanzas Profesionales del Conservatorio Profesional de Música Arturo Soria, cursos 2014-15 y 2015-16.

<P>
<P></P><DT><A NAME="boulez">4</A>
<DD>
			Boulez, Pierre.
			<SPAN  CLASS="textit">Schoenberg is dead</SPAN>,
			The Score
			(1952).

<P>
<P></P><DT><A NAME="dominguez">5</A>
<DD>
			Domínguez Romero, Manuel. 
			<SPAN  CLASS="textit">Las Matemáticas en el Serialismo Musical</SPAN>,
			Sigma n.24 
			(2004).

<P>
<P></P><DT><A NAME="ilomaki">6</A>
<DD>
			Ilom&#228;ki, Tuukka.
			<SPAN  CLASS="textit">On the Similarity of Twelve-Tone Rows</SPAN>,
			Sibelius Academy
			(2008).

<P>
<P></P><DT><A NAME="hyde">7</A>
<DD>
			Hyde, Martha. Chapter 4: “Dodecaphonism: Schoenberg”,
			<SPAN  CLASS="textit">Models of Musical Analysis: Early Twentieth-century Music</SPAN>,
			Ed. Mark Everist and Jonathan Dunsby.
			Oxford: Blackwell
			(1993)

<P>
<P></P><DT><A NAME="xiao">8</A>
<DD>
			Xiao, June. 
			<SPAN  CLASS="textit">Bach’s Influences in the Piano Music of Four 20th Century Composers</SPAN>,
			Indiana University Jacobs School of Music.
			Doctoral Theses in Music
			(2014)

<P>
<P></P><DT><A NAME="clercq">9</A>
<DD>
			Clercq, Trevor de. 
			<SPAN  CLASS="textit">A Window into Tonality via the Structure of Schoenberg's &ldquo;Musette&rdquo; from the Piano Suite, op. 25</SPAN>,
			Theory/Analysis of 20th-Century Music.
			Prof. David Headlam
			(2006)

<P>
</DL>

<P>
<BR><HR><H4>Footnotes</H4>
<DL>
<DT><A NAME="foot99">... total&#187;</A><A
 HREF="try.html#tex2html1"><SUP><SPAN CLASS="arabic">1</SPAN></SUP></A></DT>
<DD>Richard Wagner, <SPAN  CLASS="textit">Oper und Drama</SPAN>, 1851.

</DD>
<DT><A NAME="foot100">... disonancia&#187;</A><A
 HREF="try.html#tex2html2"><SUP><SPAN CLASS="arabic">2</SPAN></SUP></A></DT>
<DD>Arnold Schoenberg, <SPAN  CLASS="textit">Composition with twelve tones</SPAN>, en <SPAN  CLASS="textit">Style and Idea</SPAN>, 1950.

</DD>
<DT><A NAME="foot82">... anteriores</A><A
 HREF="try.html#tex2html3"><SUP><SPAN CLASS="arabic">3</SPAN></SUP></A></DT>
<DD>La forma sonata es el ejemplo m&#225;s destacado de estructura basada en la armon&#237;a.

</DD>
<DT><A NAME="foot102">... ahogarse”.</A><A
 HREF="try.html#tex2html4"><SUP><SPAN CLASS="arabic">4</SPAN></SUP></A></DT>
<DD>A. Schoenberg, <SPAN  CLASS="textit">Hauer's Theories</SPAN>, en <SPAN  CLASS="textit">Style and Idea</SPAN>, 1923.

</DD>
<DT><A NAME="foot384">...#tex2html_wrap_inline1300#</A><A
 HREF="try.html#tex2html5"><SUP><SPAN CLASS="arabic">5</SPAN></SUP></A></DT>
<DD><!-- MATH
 $\mathbb{Z} / (12)=\{0,\ 1,\ 2,\ 3,\ 4,\ 5,\ 6,\ 7,\ 8,\ 9,\ 10,\ 11\}$
 -->
<SPAN CLASS="MATH"><IMG
 WIDTH="335" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="try-img4.png"
 ALT="$ \mathbb{Z} / (12)=\{0,\ 1,\ 2,\ 3,\ 4,\ 5,\ 6,\ 7,\ 8,\ 9,\ 10,\ 11\}$"></SPAN>

</DD>
<DT><A NAME="foot185">...transposici&#243;n</A><A
 HREF="try.html#tex2html6"><SUP><SPAN CLASS="arabic">6</SPAN></SUP></A></DT>
<DD>No confundir con un 2-ciclo. Una transposici&#243;n musical se corresponde con una traslaci&#243;n matem&#225;tica.

</DD>
<DT><A NAME="foot689">... s\'i.</A><A
 HREF="try.html#tex2html9"><SUP><SPAN CLASS="arabic">7</SPAN></SUP></A></DT>
<DD>Para un estudio completo de las relaciones de similitud entre series se recomienda <SPAN  CLASS="textit">On the Similarity of Twelve-Tone Rows</SPAN>, de Tuukka Ilomäki. [<A
 HREF="try.html#ilomaki">6</A>]

</DD>
<DT><A NAME="foot650">... 7</A><A
 HREF="try.html#tex2html10"><SUP><SPAN CLASS="arabic">8</SPAN></SUP></A></DT>
<DD>La nota 7 aparece como bord&#243;n y no en la misma voz que el resto del tetracordio, por lo que su posici&#243;n es tambi&#233;n excepcional.

</DD>
<DT><A NAME="foot830">...,</A><A
 HREF="try.html#tex2html11"><SUP><SPAN CLASS="arabic">9</SPAN></SUP></A></DT>
<DD>En este texto se trabajar&#225; siempre con temperamento igual por convenio.

</DD>
</DL><BR><HR>

</BODY>
</HTML>
